; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	infrared1 - mode
	spectrograph0 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star0 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	Star5 - direction
	Star6 - direction
	GroundStation10 - direction
	GroundStation7 - direction
	Star3 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation9)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation7)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation8)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 GroundStation7)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star13)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 GroundStation8)
	(calibration_target instrument6 Star0)
	(supports instrument7 spectrograph0)
	(supports instrument7 infrared1)
	(calibration_target instrument7 Star6)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 GroundStation9)
	(supports instrument8 infrared1)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 Star3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet11)
	(supports instrument9 spectrograph0)
	(supports instrument9 infrared1)
	(calibration_target instrument9 GroundStation10)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
	(supports instrument10 spectrograph0)
	(supports instrument10 infrared1)
	(calibration_target instrument10 Star3)
	(calibration_target instrument10 GroundStation7)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet11)
)
(:goal (and
	(pointing satellite1 GroundStation10)
	(pointing satellite2 Star13)
	(pointing satellite4 Star16)
	(pointing satellite5 GroundStation7)
	(have_image Planet11 spectrograph0)
	(have_image Star12 spectrograph0)
	(have_image Star13 infrared1)
	(have_image Phenomenon14 spectrograph0)
	(have_image Star15 infrared1)
	(have_image Star16 infrared1)
))

)

; plan
1. (turn_to satellite5 groundstation7 planet11)
   deleted: (pointing satellite5 planet11)
   added: (pointing satellite5 groundstation7)
   goals met: 2 of 10
2. (turn_to satellite4 star16 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 star16)
   goals met: 3 of 10
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 3 of 10
4. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 3 of 10
5. (turn_to satellite1 star12 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star12)
   goals met: 3 of 10
6. (take_image satellite1 star12 instrument3 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 4 of 10
7. (turn_to satellite1 planet11 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 planet11)
   goals met: 4 of 10
8. (take_image satellite1 planet11 instrument3 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 5 of 10
9. (turn_to satellite1 phenomenon14 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon14)
   goals met: 5 of 10
10. (take_image satellite1 phenomenon14 instrument3 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 6 of 10
11. (turn_to satellite1 star13 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 star13)
   goals met: 6 of 10
12. (take_image satellite1 star13 instrument3 infrared1)
   added: (have_image star13 infrared1)
   goals met: 7 of 10
13. (turn_to satellite1 star15 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star15)
   goals met: 7 of 10
14. (take_image satellite1 star15 instrument3 infrared1)
   added: (have_image star15 infrared1)
   goals met: 8 of 10
15. (turn_to satellite1 star16 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star16)
   goals met: 8 of 10
16. (take_image satellite1 star16 instrument3 infrared1)
   added: (have_image star16 infrared1)
   goals met: 9 of 10
17. (turn_to satellite1 groundstation10 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 groundstation10)
   goals met: 10 of 10
